app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", ""], ["last_name", ""], ["email", "faf@dhf.com"], ["created_at", "2023-03-06 11:40:35.742107"], ["updated_at", "2023-03-06 11:40:35.742107"]]
---
    def create
        @student = Student.new(student_params)
        if @student.save

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "email" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Avinash"], ["last_name", "Ananda"], ["email", "aananda@gmail.com"], ["updated_at", "2023-03-06 11:33:12.372232"], ["id", 22]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Alexa"], ["last_name", "Amazon"], ["updated_at", "2023-03-06 10:51:45.407347"], ["id", 26]]
---
    def update
        @student.update(student_params)
        if @student.save